app/controllers/users_controller.rb

  def create

    @user = User.new(params[:user])


    respond_to do |format|
      if @user.save then
---
INSERT INTO `users` (`last_request_at`, `created_at`, `crypted_password`, `from`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `nick_name`, `last_login_ip`, `uprising_since`, `login`, `last_login_at`, `email`) VALUES('2009-07-29 18:38:42', '2009-07-29 18:38:42', 'ece66b69720d2a84cda305c7928d2218700ddf2d155a34602bc49914e3ac8d66f27e28e9588a745cde49a9f796d4a585dab46049c2b93d2a42f430a305a3db42', 'Portland,ME', '2009-07-29 18:38:42', 0, '127.0.0.1', 'PLfLDriEA2iq6S5DnCMz', '2009-07-29 18:38:42', '0f6b25b870ed3cea04354875d88e9c084551628204a1e89353cbae0aeda3e9a36d111876770d8dae8b52bfc46bc0f4ec923b2ad1279a31f5dda8909fc5677fce', 1, 'Philip', NULL, '2009-06-29', 'test', NULL, 'test@test.com')